{
  "format": "layers-model",
  "generatedBy": "TensorFlow.js v4.10.0",
  "convertedBy": "DigitRecognizer Demo",
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential",
      "layers": [
        {
          "class_name": "Flatten",
          "config": {
            "name": "flatten",
            "trainable": true,
            "batch_input_shape": [null, 28, 28, 1],
            "dtype": "float32",
            "data_format": "channels_last"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense",
            "trainable": true,
            "dtype": "float32",
            "units": 128,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_1",
            "trainable": true,
            "dtype": "float32",
            "units": 10,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        }
      ]
    },
    "keras_version": "2.13.1",
    "backend": "tensorflow"
  },
  "weightsManifest": [
    {
      "paths": ["demo-model.weights.bin"],
      "weights": [
        {
          "name": "dense/kernel",
          "shape": [784, 128],
          "dtype": "float32"
        },
        {
          "name": "dense/bias",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel",
          "shape": [128, 10],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [10],
          "dtype": "float32"
        }
      ]
    }
  ]
}
